Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Homepage
ja: ホームページ

source: Hopefully you didn't dismiss the error dialog immediately; error dialogs are a normal part of the process of coding, and often contain very useful information.
ja: エラーダイアログは、コーディングの過程では当たり前のことであり、非常に有用な情報が含まれていることが多いからです。

source: Hot track selection means that an item is automatically selected when the cursor remains over the item for a certain period of time.
ja: ホットトラック選択とは、カーソルがその項目の上にある状態が一定時間続くと、その項目が自動的に選択されることを意味する。

source: Hot tracking means that when the cursor moves over an item, it is highlighted but not selected.
ja: ホットトラッキングとは、カーソルがアイテムの上に移動すると、そのアイテムはハイライトされるが選択されないことを意味する。

source: HotIf - Syntax & Usage | AutoHotkey v2
ja: HotIf - 構文と使用法｜AutoHotkey v2

source: HotIf allows context-sensitive hotkeys to be created and modified while the script is running (by contrast, the #HotIf directive is positional and takes effect before the script begins executing).
ja: HotIfでは、スクリプトの実行中にコンテキストに応じたホットキーを作成・変更することができます（これに対し、#HotIfディレクティブは位置指定で、スクリプトの実行開始前に効果を発揮します）。

source: Hotkey "#n", "Off" ; Turn the hotkey off.
ja: Hotkey "#n", "Off" ; ホットキーをオフにします。

source: Hotkey "#n", "On" ; Turn the same hotkey back on.
ja: Hotkey "#n", "On" ; 同じホットキーを再びオンにします。

source: Hotkey "^!e", MyFuncForNotepad ; Creates a hotkey that works only in Notepad.
ja: Hotkey "^!e", MyFuncForNotepad ; メモ帳でのみ動作するホットキーを作成します。

source: Hotkey - Syntax & Usage | AutoHotkey v2
ja: Hotkey - 構文と使用法｜AutoHotkey v2

source: Hotkey Modifier Symbols
ja: ホットキーモディファイアの記号

source: Hotkey Tips and Remarks
ja: ホットキーのヒントと備考

source: Hotkey and Hotstring Labels
ja: ホットキーとホットストリングラベル

source: Hotkey and hotstring definitions look similar to labels, but are not labels.
ja: ホットキーとホットストリングの定義はラベルに似ていますが、ラベルではありません。

source: Hotkey macros like the above are especially useful for tasks you perform several times per day.
ja: 上記のようなホットキー・マクロは、1日に何度も行う作業には特に便利です。

source: Hotkey/hotstring and HotIf threads default to the same criterion as the hotkey, so Hotkey A_ThisHotkey, "Off" turns off the current hotkey even if it is context-sensitive.
ja: Hotkey/HotstringおよびHotIfスレッドのデフォルトは、ホットキーと同じ基準なので、Hotkey A_ThisHotkey, "Off"は、現在のホットキーがコンテキスト依存であってもオフにします。

source: Hotkeys
ja: ホットキー

source: Hotkeys & Hotstrings
ja: ホットキーとホットストリング

source: Hotkeys (mouse, controller and keyboard shortcuts)
ja: ホットキー（マウス、コントローラー、キーボードショートカット）

source: Hotkeys (mouse, joystick and keyboard shortcuts)
ja: ホットキー（マウス、ジョイスティック、キーボードのショートカットキー）

source: Hotkeys - Definition & Usage | AutoHotkey v2
ja: ホットキー - 定義と使用法｜AutoHotkey v2

source: Hotkeys (Mouse, Controller and Keyboard Shortcuts)
ja: ホットキー（マウス、コントローラー、キーボードショートカット）

source: Hotkeys (Mouse, Joystick and Keyboard Shortcuts)
ja: ホットキー（マウス、ジョイスティック、キーボードショートカット）

source: Hotkeys and hotstrings can be suspended by the Suspend function or via the tray icon or main window.
ja: ホットキーとホットストリングは、サスペンド機能、またはトレイアイコンやメインウィンドウからサスペンドすることができます。

source: Hotkeys and their methods - See ListHotkeys.
ja: ホットキーとそのメソッド -ListHotkeysを参照してください。

source: Hotkeys are also blocked, so for instance, a non-elevated program cannot spy on input intended for an elevated program.
ja: ホットキーもブロックされるため、例えば、昇格していないプログラムが昇格したプログラム向けの入力を盗み見ることはできない。

source: Hotkeys are sometimes referred to as shortcut keys because of their ability to easily trigger an action (such as launching a program or keyboard macro).
ja: ホットキーは、アクション（プログラムの起動やキーボードマクロなど）を簡単に起動できることから、ショートカットキーと呼ばれることもあります。

source: Hotkeys can also be assigned a function name without the Hotkey function.
ja: Hotkeyには、Hotkeyの機能を伴わない機能名を割り当てることもできます。

source: Hotkeys defined with the double-colon syntax automatically use the parameter name ThisHotkey.
ja: ダブルコロン構文で定義されたホットキーは、自動的にパラメータ名ThisHotkeyを使用します。

source: Hotkeys like ~#a:: still suppress the menu, since the system detects that Win has been used in combination with another key.
ja: Winが他のキーと組み合わせて使用されたことをシステムが検出するため、~#a::のようなホットキーでもメニューは抑制されます。

source: Hotkeys now mask the Win/Alt key on release only if it is logically down and the hotkey requires the Win/Alt key (with #/! or a custom prefix).
ja: ホットキーが論理的に下にあり、ホットキーがWin/Altキーを必要とする場合のみ、リリース時にWin/Altキーをマスクするようになりました（#/!またはカスタム接頭辞付き）。

source: Hotkeys owned by another application can be overridden or disabled simply by assigning them to an action in the script.
ja: 他のアプリケーションのホットキーは、スクリプトのアクションに割り当てるだけで、上書きしたり無効にしたりすることができます。

source: Hotkeys send their keystrokes via the SendInput or SendPlay methods.
ja: ホットキーは、SendInputまたはSendPlayメソッドでキーストロークを送信します。

source: Hotkeys that fire upon turning the mouse wheel are supported via the key names WheelDown and WheelUp.
ja: マウスのホイールを回転させることで発動するホットキーは、WheelDownとWheelUpのキー名でサポートされています。

source: Hotkeys that include Win (e.g. #a) will wait for Win to be released before sending any text containing an L keystroke.
ja: Winを含むホットキー（例：#a）は、Lのキーストロークを含むテキストを送信する前に、Winが解除されるのを待ちます。

source: Hotkeys using the "reg" method are incapable of distinguishing physical and artificial input, so are not affected by SendLevel.
ja: "reg"方式のホットキーは、物理的な入力と人工的な入力を区別することができないため、SendLevelの影響を受けません。

source: Hotkeys vs. Send
ja: ホットキーと送信の比較

source: Hotkeys will be implemented using the default method (RegisterHotkey() if possible; otherwise, the keyboard hook).
ja: ホットキーは、デフォルトの方法（可能であればRegisterHotkey()、そうでなければキーボードフック）を使って実装されます。

source: Hotkeys with the tilde modifier are not intended to block the native function of the key, so they do not cause masking.
ja: チルダ修飾子を持つホットキーは、キーのネイティブ機能をブロックすることを目的としていないため、マスキングを引き起こすことはありません。

source: Hotkeys, Hotstrings, and Custom Menu Items
ja: ホットキー、ホットストリング、カスタムメニュー項目

source: Hotkeys, Hotstrings, and Custom Menu Items:
ja: ホットキー、ホットストリング、カスタムメニュー項目：

source: Hotkeys, Hotstrings, and Custom Menu Items: A_ThisHotkey, A_EndChar, (...more...)
ja: ホットキー、ホットストリング、カスタムメニュー項目：A_ThisHotkey、A_EndChar、(...もっと...)

source: Hotkeys, Hotstrings, and Remapping
ja: ホットキー、ホットストリング、リマッピング

source: Hotkeys/hotstrings don't work when a program running as admin is active.
ja: 管理者として動作するプログラムがアクティブな場合、ホットキー/ホットストリングが機能しない。

source: Hotstring - Syntax & Usage | AutoHotkey v2
ja: Hotstring - 構文と使用法｜AutoHotkey v2

source: Hotstring Entered.Label, Entered.Replacement ; Enable the hotstring now.
ja: Hotstring Entered.Label, Entered.Replacement ; 今すぐHotstringを有効にします。

source: Hotstring Helper
ja: ホットストリングヘルパー

source: Hotstring Helper.
ja: Hotstring Helperです。

source: Hotstring modifiers go between the first set of colons.
ja: ホットストリング修飾子は、最初のコロンのペアの間に置く。

source: Hotstring scripts are also automatically #SingleInstance unless #SingleInstance Off has been specified.
ja: Hotstring スクリプトも、#SingleInstance Offが指定されていない限り、自動的に#SingleInstanceとなります。

source: Hotstrings
ja: ホットストリング

source: Hotstrings - Definition & Usage | AutoHotkey v2
ja: ホットストリング - 定義と使用法｜AutoHotkey v2

source: Hotstrings and auto-replace
ja: ホットストリングと自動置換

source: Hotstrings are mainly used to expand abbreviations as you type them (auto-replace), they can also be used to launch any scripted action.
ja: ホットストリングは主に、入力した略語を展開する（自動置換）ために使用されますが、スクリプト化されたアクションを起動するためにも使用できます。

source: Hotstrings are not monitored and will not be triggered while input is blocked by an invisible Input hook.
ja: ホットストリングは監視されず、不可視のInputフックによって入力がブロックされている間はトリガーされない。

source: Hotstrings behave identically to hotkeys in the following ways:
ja: ホットストリングの動作は、以下の点でホットキーと同じです：

source: Hotstrings can also be assigned a function name without the Hotstring function.
ja: Hotstringは、Hotstringの機能を使わずに、関数名を割り当てることもできます。

source: Hotstrings can be created dynamically by means of the Hotstring function, which can also modify, disable, or enable the script's existing hotstrings individually.
ja: ホットストリングは、Hotstring関数によって動的に作成することができ、スクリプトの既存のホットストリングを個別に変更、無効化、有効化することも可能です。

source: Hotstrings defined with the double-colon syntax automatically use the parameter name ThisHotkey.
ja: ダブルコロン構文で定義されたHotstringsは、自動的にパラメータ名ThisHotkeyを使用します。

source: Hotstrings no longer escape colons in pairs, which means it is now possible to escape a single colon at the end of the hotstring trigger.
ja: ホットストリングは、ペアでコロンをエスケープすることはなくなりました。つまり、ホットストリングトリガーの最後に1つのコロンをエスケープすることが可能になりました。

source: Hotstrings now treat Shift+Backspace the same as Backspace, instead of transcribing it to `b within the hotstring buffer.
ja: ホットストリングで、Shift+Backspaceを Backspaceと同じように扱い、ホットストリングバッファ内で`bに転写するようになりました。

source: Hotstrings that produce a large amount of replacement text can be made more readable and maintainable by using a continuation section.
ja: 大量の置換テキストを生成するHotstringsは、継続セクションを使用することで、より読みやすく、保守的にすることができます。

source: Hotstrings use the first pair of colons (::) as a delimiter rather than the last when multiple pairs of colons are present.
ja: ホットストリングは、複数のコロンの組が存在する場合、最後の組ではなく、最初の組のコロン（::）を区切り文字として使用します。

source: Hotstrings with continuation sections now default to Text mode instead of Raw mode.
ja: 継続セクションを持つホットストリングのデフォルトが、RawモードではなくTextモードになりました。

source: Hotstrings, as mentioned above, can also launch scripted actions.
ja: 前述のように、ホットストリングはスクリプト化されたアクションを起動することもできます。

source: Hours with leading zero; 12-hour format (01 – 12)
ja: 時間（先頭のゼロあり）、12時間形式（01～12）

source: Hours with leading zero; 24-hour format (00 – 23)
ja: 時間（先頭のゼロあり）、24時間形式（00～23）

source: Hours without leading zero; 12-hour format (1 – 12)
ja: 時間（先頭のゼロなし）、12時間形式（1〜12）

source: Hours without leading zero; 24-hour format (0 – 23)
ja: 時間（先頭のゼロをなし）、24時間形式（0～23）

source: Hover over a variable to view its contents.
ja: 変数にカーソルを合わせると、その内容が表示されます。

source: Hover over variable to show contents.
ja: 変数にカーソルを合わせると内容が表示されます。

source: Hovering over a single-letter variable name does not work - for instance, hovering over a will attempt to retrieve a or a .
ja: 1 文字の変数にカーソルを合わせても機能しません。たとえば、a にカーソルを合わせると、 a または a を取得しようとしてしまいます。

source: Hovering over text will attempt to retrieve a variable even if the text contains invalid characters.
ja: テキストにカーソルを合わせると、テキストに不正な文字が含まれていても、変数の取得を試みます。

source: How can MsgBox's button names be changed?
ja: MsgBoxのボタン名を変更するにはどうすればよいですか？

source: How can I change the default editor, which is accessible via context menu or tray icon?
ja: コンテキストメニューやトレイアイコンからアクセスできるデフォルトのエディターを変更したいのですが？

source: How can I find and fix errors in my code?
ja: スクリプトのエラーを見つけて修正するにはどうすればよいですか？

source: How can I save the contents of my GUI controls?
ja: GUIコントロールの内容を保存したいのですが、どうすればよいですか？

source: How can I send text to a window which isn't active or isn't visible?
ja: アクティブでない、または表示されていないウィンドウにテキストを送信するにはどうしたらよいですか？

source: How can I send the current Date and/or Time?
ja: 現在の日付や時刻を送信したいのですが、どうすればよいですか？

source: How can I start an action when a window appears, closes or becomes [in]active?
ja: ウィンドウが表示されたり、閉じたり、[in]アクティブになったときに、アクションを開始するにはどうしたらよいですか？

source: How can I use a hotkey that is not in my keyboard layout?
ja: キーボードレイアウトにないホットキーを使うにはどうしたらいいですか？

source: How can Tab and Space be defined as hotkeys?
ja: TabとSpaceをホットキーとして定義する方法は？

source: How can Winamp be controlled even when it isn't active?
ja: Winampがアクティブでないときでもコントロールできるようにするには？

source: How can a hotkey or hotstring be made exclusive to certain program(s)?
ja: ホットキーや ホットストリングを特定のプログラム専用にするにはどうすればよいですか？

source: How can a prefix key be made to perform its native function rather than doing nothing?
ja: プレフィックスキーが何もしないのではなく、本来の機能を発揮させるためにはどうしたらいいのでしょうか？

source: How can a repeating action be stopped without exiting the script?
ja: スクリプトを終了させることなく、繰り返し動作を停止させるにはどうすればよいですか？

source: How can a script close, pause, suspend or reload other script(s)?
ja: 他のスクリプトを閉じたり、一時停止したり、中断したり、再読み込みしたりするにはどうしたらよいですか？

source: How can context sensitive help for AutoHotkey functions be used in any editor?
ja: AutoHotkeyの関数のコンテキスト依存ヘルプを、どのエディターでも使えるようにするにはどうしたらよいですか？

source: How can dates and times be compared or manipulated?
ja: 日付や時刻を比較したり、操作したりするにはどうすればよいですか？

source: How can keys or mouse buttons be remapped so that they become different keys?
ja: キーやマウスのボタンを別のキーになるようにリマップするにはどうすればよいですか？

source: How can performance be improved for games or at other times when the CPU is under heavy load?
ja: ゲームなど、CPUに負荷がかかる場面でパフォーマンスを向上させるにはどうすればよいですか？

source: How can tab and space be defined as hotkeys?
ja: タブとスペースをホットキーとして定義するにはどうすればよいですか？

source: How can the built-in Windows shortcut keys, such as Win+U (Utility Manager) and Win+R (Run), be changed or disabled?
ja: Win+U（ユーティリティマネージャ）やWin+R（ファイル名を指定して実行）など、Windowsに内蔵されているショートカットキーを変更したり無効にしたりするには、どうしたらよいですか？

source: How can the output of a command line operation be retrieved?
ja: コマンドライン操作の出力はどのように取得できますか？

source: How do I detect the double press of a key or button?
ja: キーやボタンの二度押しを検出するにはどうすればよいですか？

source: How do I put my hotkeys and hotstrings into effect automatically every time I start my PC?
ja: PCを起動するたびに、ホットキーやホットストリングを自動的に有効にするにはどうすればよいですか？

source: How do I restore the right-click context menu options for .ahk files?
ja: .ahkファイルの右クリックコンテキストメニューオプションを復元するにはどうすればよいですか？

source: How do I work around problems caused by User Account Control (UAC)?
ja: ユーザーアカウント制御（UAC）に起因する問題を回避するにはどうすればよいですか？

source: How literal text should be written within the script depends on the context.
ja: スクリプトの中でどのようにリテラルテキストを書くべきかは、文脈によって異なります。

source: How many seconds to wait before timing out and returning 0.
ja: タイムアウトして0を返すまでの待ち時間。

source: How many times (iterations) to perform the loop.
ja: ループを何回（反復）実行するか。

source: How the object is invoked has changed.
ja: オブジェクトの呼び出し方が変わりました。

source: How to Install AutoHotkey
ja: AutoHotkeyのインストール方法

source: How to Install AutoHotkey | AutoHotkey v2
ja: AutoHotkeyのインストール方法｜AutoHotkey v2

source: How to Manage Windows
ja: ウインドウを管理する方法

source: How to Manage Windows | AutoHotkey v2
ja: ウインドウを管理する方法｜AutoHotkey v2

source: How to Run Example Code
ja: サンプルコードの実行方法

source: How to Run Example Code | AutoHotkey v2
ja: サンプルコードの実行方法｜AutoHotkey v2

source: How to Run Programs
ja: プログラムの実行方法

source: How to Run Programs | AutoHotkey v2
ja: プログラムの実行方法｜AutoHotkey v2

source: How to Send Keystrokes
ja: キーストロークの送信方法

source: How to Send Keystrokes | AutoHotkey v2
ja: キーストロークの送信方法｜AutoHotkey v2

source: How to Write Hotkeys
ja: ホットキーの書き方

source: How to Write Hotkeys | AutoHotkey v2
ja: ホットキーの書き方｜AutoHotkey v2

source: How to create a script
ja: スクリプトの作成方法

source: How to detect when a web page is finished loading?
ja: Webページの読み込みが終了したことを検知するにはどうすればよいですか？

source: How to find the flaws in a misbehaving script.
ja: 誤動作するスクリプトの欠陥を見つける方法。

source: How to find the help file on your computer
ja: ヘルプファイルの探し方

source: How to manage windows
ja: ウィンドウズの管理方法

source: How to run example code
ja: サンプルコードの実行方法

source: How to run programs
ja: プログラムの実行方法

source: How to send keystrokes
ja: キー入力の送信方法

source: How to use AutoHotkey, in general.
ja: AutoHotkeyの一般的な使い方。

source: How to use functions
ja: 機能の使用方法

source: How to use objects, define new types of objects, and other details about how objects work in AutoHotkey.
ja: オブジェクトの使用方法、新しいタイプのオブジェクトの定義、AutoHotkeyでのオブジェクトの動作に関するその他の詳細。

source: How to use the available modes and options to get the right end result.
ja: 正しい結果を得るために、利用可能なモードやオプションをどのように使用するか。

source: How to use the program
ja: プログラムの使用方法

source: How to write hotkeys
ja: ホットキーの書き方

source: How to write the code
ja: コードの書き方

source: How to write the code so that the program knows which keys you want to send.
ja: どのキーを送りたいのか、プログラムがわかるようにコードを書く方法。

source: How you write the code affects which quote marks actually make it through to the Run function.
ja: コードの書き方によって、どの引用符が実際に実行機能で処理されるかが変わります。

source: However there are methods that can increase the chance of working in some games, but there is no magical "make it work in my game now!!!" button.
ja: しかし、ゲームによっては動作する可能性を高める方法はありますが、魔法のような「今すぐ私のゲームで動作させる！」ボタンはありません。。

source: However, interrupted threads are unaffected because their period of uninterruptibility has already expired.
ja: しかし、中断されたスレッドは、中断されない期間がすでに終了しているため、影響を受けない。

source: However, VarSetStrCapacity(&Var, 0) does free it.
ja: しかし、VarSetStrCapacity(&Var, 0)はそれを解放する。

source: However, (: is an error and (:: is still a hotkey.
ja: ただし、(:はエラーで、(::はホットキーのままです。

source: However, Subclass.ClassVar := y would store the value in Subclass, not in ClassName.
ja: ただし、Subclass.ClassVar := yは、ClassNameではなくSubclassに値を格納します。

source: However, myObj := Object() only affects the variable myObj, not the variable yourObj, which still refers to the original object.
ja: しかし、myObj := Object()は変数myObjにのみ影響し、変数yourObjはまだ元のオブジェクトを参照しているわけではありません。

source: However, ClassName.Prototype is resolved at load time.
ja: しかし、ClassName.Prototypeはロード時に解決される。

source: However, StartingPos has no effect on the direction of the search if Occurrence is specified.
ja: ただし、Occurrenceを指定したときは、StartingPosは検索の方向には影響しません。

source: However, A_EventInfo can be greater or less than 120 under the following circumstances:
ja: ただし、以下の場合はA_EventInfoが120より大きくなったり小さくなったりすることがある：

source: However, AutoHotkey can utilize the CLR through COM callable wrappers.
ja: しかし、AutoHotkeyは、COM呼び出し可能なラッパーを通してCLRを利用することができます。

source: However, AutoHotkey v2 separates properties from array/map/collection items, and to do this obj[x] is mapped to the object's default property (whether or not x is present).
ja: しかし、AutoHotkey v2では、プロパティを配列/マップ/コレクションの項目から分離しており、そのためにobj[x]はオブジェクトのデフォルトのプロパティ（xが存在するかどうか）にマッピングされています。

source: However, InStr is generally faster than RegExMatch when searching for a simple substring.
ja: しかし、単純な部分文字列を検索する場合は、一般にInStrの方がRegExMatchより高速です。

source: However, Loop Until is often easier to understand and unlike the above, can be used with a single-line action.
ja: しかし、ループ・アンティル（Loop Until）の方が理解しやすい場合が多く、上記とは異なり、1行のアクションで使用することができる。

source: However, MouseClick supports the Speed parameter, whereas adjusting the speed of movement by Click requires the use of SetDefaultMouseSpeed.
ja: ただし、MouseClickはSpeedパラメータをサポートしていますが、Clickによる移動速度の調整はSetDefaultMouseSpeedを使用する必要があります。

source: However, ObjBindMethod is useful when the object has multiple methods which should be called by different event sources, such as hotkeys, menu items, GUI controls, etc.
ja: しかし、ObjBindMethodは、オブジェクトがホットキー、メニューアイテム、GUIコントロールなど、異なるイベントソースによって呼び出されるべき複数のメソッドを持つ場合に便利です。

source: However, VS Code likely provides the best experience, with easiest setup.
ja: しかし、VS Codeは最も簡単なセットアップで、最高のエクスペリエンスを提供してくれるだろう。

source: However, __Call is not triggered in certain contexts, such as when __Enum is being called by For.
ja: ただし、__EnumがForによって呼び出されている場合など、特定のコンテキストでは__Callはトリガーされません。

source: However, a Loop can be used to simulate auto-repeat.
ja: しかし、Loopを使用することでオートリピートを模擬することができます。

source: However, a Delay of 0 should always wind up being shorter than any longer Delay would have been.
ja: しかし、Delayを0にすると、Delayが長くなるよりも短くなるはずだ。

source: However, a closure may safely refer to itself and other closures by their original variables without creating a circular reference.
ja: しかし、クロージャは、循環参照を作成することなく、自分自身や他のクロージャを元の変数で安全に参照することができます。

source: However, a hotstring's replacement text uses the same syntax as Send (except when the T option is used).
ja: ただし、ホットストリングの置換テキストは、Sendと同じ構文を使用します（Tオプションを使用した場合を除く）。

source: However, a loop with only a single statement does not require a block (an "if" and its "else" count as a single statement for this purpose).
ja: ただし、1つの文しかないループにはブロックは必要ありません（「if」とその「else」は、この目的のために1つの文としてカウントされます）。

source: However, a non-dynamic assignment inside a nested function typically resolves to a local variable if the outer function has neither a declaration nor a non-dynamic assignment for that variable.
ja: しかし、入れ子になった関数内の非動的代入は、外側の関数にその変数に対する宣言も非動的代入もない場合、通常ローカル変数に解決されます。

source: However, a standalone function call cannot be followed by an open brace { (at the end of the line or on the next line), because it would be confused with a function declaration.
ja: ただし、単独の関数呼び出しには、関数宣言と混同されるため、（行末や次の行で）開波括弧{を付けることはできません。

source: However, a variable's memory can be freed after use by assigning it to nothing, i.e. Text := "".
ja: ただし、Text := ""のように、変数に何も代入しないことで、使用後に変数のメモリを解放することができます。

source: However, an exception is thrown if Menu is a MenuBar object.
ja: ただし、MenuがMenuBarオブジェクトである場合は例外が発生します。

source: However, an exception is thrown if MyMenu is a MenuBar object.
ja: ただし、MyMenuがMenuBarオブジェクトである場合は例外が発生します。

source: However, an explicit blank value or number less than 1 causes the loop to be skipped entirely.
ja: ただし、明示的な空白値や1未満の数値は、ループが完全にスキップされることになります。

source: However, any files or subfolders inside Dest that do not have a counterpart in Source will not be deleted.
ja: ただし、Dest内のファイルやサブフォルダで、Sourceに対応するものがないものは削除されません。

source: However, any files or subfolders inside DestPattern that do not have a counterpart in SourcePattern will not be deleted.
ja: ただし、DestPattern内のファイルやサブフォルダで、SourcePatternに対応するものがないものは削除されません。

source: However, any of the characters in the set \.*?+[{|()^$ must be preceded by a backslash to be seen as literal.
ja: しかし、\.*?+[{|()^$ の集合に含まれる文字は、リテラルとみなされるためには、その前にバックスラッシュが必要です。

source: However, any other timers will continue to run by interrupting the thread that interrupted the first timer.
ja: ただし、他のタイマーは、最初のタイマーを中断したスレッドに割り込んで実行し続ける。

source: However, any programs or scripts which the script launches by calling Run or RunWait usually inherit a copy of the parent script's environment variables.
ja: ただし、Runや RunWaitを呼び出してスクリプトが起動するプログラムやスクリプトは、通常、親スクリプトの環境変数のコピーを引き継ぎます。

source: However, any sub-control explicitly disabled via GuiCtrl.Enabled := false will remember that setting and thus remain disabled even after its Tab control is re-enabled.
ja: ただし、GuiCtrl.Enabled := false で明示的に無効化されたサブコントロールは、その設定を記憶しているため、そのタブコントロールが再度有効化された後も無効のままです。

source: However, as a blank Needle would typically only be passed by mistake, it is treated as an error (an exception is thrown).
ja: しかし、空白のNeedleは通常間違って渡されるだけなので、エラーとして扱われ、例外がスローされます。

source: However, as a blank Needle would typically only by passed by mistake, it is treated as an error (an exception is thrown).
ja: しかし、空白のNeedleは通常間違って渡されるだけなので、エラーとして扱われます（例外がスローされます）。

source: However, as a special exception, the source code distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable.
ja: ただし、特別な例外として、配布されるソースコードには、その実行ファイルが実行されるオペレーティング・システムの主要なコンポーネント(コンパイラ、カーネルなど)と一緒に(ソースまたはバイナリの形で)通常配布されるものを含める必要はありません。

source: However, at least one line will execute before the thread becomes interruptible, allowing the script to enable Critical, if needed.
ja: しかし、スレッドが割り込み可能になる前に少なくとも1行は実行されるので、スクリプトは必要に応じてクリティカルを有効にすることができる。

source: However, attempting to read a variable before it is given a value is considered an error.
ja: ただし、値が与えられる前に変数を読み取ろうとするとエラーとみなされます。

source: However, auto-replace hotstrings always use send level 0 and therefore never trigger hook hotkeys or hotstrings.
ja: ただし、自動置換ホットストリングは常に送信レベル0を使用するため、フックホットキーやホットストリングがトリガーされることはない。

source: However, automatic scaling does have negative implications.
ja: しかし、自動スケーリングには否定的な意味合いもある。

source: However, basic manipulation of such strings is supported; e.g. concatenation, ==, !==, Chr(0), StrLen, SubStr, assignments, parameter values and return.
ja: ただし、連結、==、!==、Chr(0)、StrLen、SubStr、代入、パラメータ値、戻り値など、文字列の基本操作はサポートされています。

source: However, comments can be included on the bottom and top lines of the section.
ja: ただし、セクションの最下行と最上行にコメントを入れることができる。

source: However, common audio drivers tend to have only volume and mute controls, or no components at all.
ja: しかし、一般的なオーディオ・ドライバーには、ボリュームとミュート・コントロールしかないか、コンポーネントがまったくないことが多い。

source: However, directives, double-colon hotkey and hotstring tags, and declarations without assignments are not statements; they are processed when the program first starts up, before the script executes.
ja: ただし、ディレクティブ、ダブルコロンのホットキーやホットストリングタグ、割り当てのない宣言はステートメントではなく、プログラムが最初に起動したとき、スクリプトが実行される前に処理されます。
